app/controllers/school_classes_controller.rb

  def update
    @school_class = SchoolClass.find(params[:id])
    @school_class.update(post_params)
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2018-06-07 14:58:34.079097"], ["id", 1]]